<script lang="ts" setup>
import BaseHeader from '~/components/layout/header/BaseHeader.vue'
import HeaderBackButton from '~/components/layout/header/HeaderBackButton.vue'
import HeaderTitle from '~/components/layout/header/HeaderTitle.vue'

const faq = [
  {
    question: 'Как записаться на событие?',
    answer:
      'Выберите интересующее событие в разделе "Афиша" и нажмите кнопку "Записаться". После этого вы автоматически попадёте в список участников.',
  },
  {
    question: 'Можно ли отменить участие?',
    answer:
      'Да, вы можете отменить участие в любое время до начала события. Для этого перейдите в профиль и отмените регистрацию.',
  },
  {
    question: 'Есть ли ограничение по участникам?',
    answer:
      'Да, количество участников ограничено. После заполнения всех мест регистрация автоматически закрывается и открывается лист ожидания. Как только подойдет ваша очередь, вам будет присвоен номер участника, после чего вы сможете выбрать место за столом.',
  },
  {
    question: 'Начисляются ли очки за участие?',
    answer:
      'Да, за участие в событиях начисляются очки рейтинга. Количество очков зависит от типа игры и события.',
  },
  {
    question: 'Как работает рейтинг?',
    answer:
      'Рейтинг формируется на основе набранных очков. Чем больше вы участвуете и выигрываете — тем выше ваша позиция.',
  },
  {
    question: 'Нужно ли платить за участие?',
    answer:
      'Некоторые события могут быть платными. Информация об этом указывается в карточке события.',
  },
  {
    question: 'Можно ли участвовать без регистрации?',
    answer:
      'Нет, участие возможно только после регистрации. Зарегистрироваться можно через приложение или через нашего администратора в Telegram-канале @duckspokerspace.',
  },
  {
    question: 'Что делать, если я опоздал на событие?',
    answer:
      'Рекомендуем приходить заранее. В случае опоздания участие может быть ограничено по решению организатора.',
  },
  {
    question: 'Как связаться с поддержкой?',
    answer: 'Вы можете написать нам через раздел "Help" в приложении или связаться через Telegram.',
  },
]
</script>

<template>
  <BaseHeader>
    <template #left>
      <HeaderBackButton />
    </template>

    <template #default>
      <HeaderTitle title="FAQ" />
    </template>
  </BaseHeader>

  <div class="p-4 space-y-3">
    <FaqItem v-for="(item, i) in faq" :key="i" :faq="item" />
  </div>
</template>
